### 1. 라이브러리 & 데이터 리딩

In [3]:
# 수치화를 위한 라이브러리 
import pandas as pd 
import numpy as np 

# 시각화를 위한 라이브러리 
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
# 한글 깨짐 방지
from matplotlib import rc
rc('font', family ='AppleGothic')

In [42]:
df = pd.read_csv('data-3/customer_data.csv', sep='\t') # 쉼표가 아닌, tab으로 구분 되어있음

# pd.set_option('display.max_columns', None)
# 생략되는 칼럼 없이 보여줌 

df.head()

,ID,signup_ym,birth_year,annual_income,marital_status,children,recency,amount_alcohol,amount_fruit,amount_meat,amount_fish,amount_snack,amount_general,num_purchase_web,num_purchase_store,num_purchase_discount,promotion_1,promotion_2,promotion_3,promotion_4,promotion_5,promotion_6,revenue
0,5524,2020-12,1965,75579400.0,미혼,0,58,825500,114400,709800,223600,114400,114400,8,4,3,0,0,0,0,0,1,11
1,2174,2022-06,1962,60247200.0,미혼,2,38,14300,1300,7800,2600,1300,7800,1,2,2,0,0,0,0,0,0,11
2,4141,2021-11,1973,93096900.0,배우자 있음,0,26,553800,63700,165100,144300,27300,54600,8,10,1,0,0,0,0,0,0,11
3,6182,2022-05,1992,34639800.0,배우자 있음,1,26,14300,5200,26000,13000,3900,6500,2,4,2,0,0,0,0,0,0,11
4,5324,2022-04,1989,75780900.0,배우자 있음,1,94,224900,55900,153400,59800,35100,19500,5,6,5,0,0,0,0,0,0,11

In [45]:
df.columns.tolist()

['ID',
 'signup_ym',
 'age',
 'annual_income',
 'marital_status',
 'children',
 'recency',
 'amount_alcohol',
 'amount_fruit',
 'amount_meat',
 'amount_fish',
 'amount_snack',
 'amount_general',
 'num_purchase_web',
 'num_purchase_store',
 'num_purchase_discount',
 'promotion_1',
 'promotion_2',
 'promotion_3',
 'promotion_4',
 'promotion_5',
 'promotion_6',
 'revenue']

### 2. 결측치 및 칼럼처리

In [12]:
# 데이터 크기 확인 
df.shape

(2240, 23)

#### 2.1 결측치 확인

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 23 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID                     2240 non-null   int64
 1   signup_ym              2240 non-null   object
 2   birth_year             2240 non-null   int64
 3   annual_income          2216 non-null   float64
 4   marital_status         2240 non-null   object
 5   children               2240 non-null   int64
 6   recency                2240 non-null   int64
 7   amount_alcohol         2240 non-null   int64
 8   amount_fruit           2240 non-null   int64
 9   amount_meat            2240 non-null   int64
 10  amount_fish            2240 non-null   int64
 11  amount_snack           2240 non-null   int64
 12  amount_general         2240 non-null   int64
 13  num_purchase_web       2240 non-null   int64
 14  num_purchase_store     2240 non-null   int64
 15  num_purchase_discount  2240 non-null   int64
 16  promotion_1            2240 non-null   int64
 17  promotion_2            2240 non-null   int64
 18  promotion_3            2240 non-null   int64
 19  promotion_4            2240 non-null   int64
 20  promotion_5            2240 non-null   int64
 21  promotion_6            2240 non-null   int64
 22  revenue                2240 non-null   int64
dtypes: float64(1), int64(20), object(2)
memory usage: 402.6+ KB

- annual income에 결측치가 존재함

In [18]:
df.isnull().sum()

ID                        0
signup_ym                 0
birth_year                0
annual_income            24
marital_status            0
children                  0
recency                   0
amount_alcohol            0
amount_fruit              0
amount_meat               0
amount_fish               0
amount_snack              0
amount_general            0
num_purchase_web          0
num_purchase_store        0
num_purchase_discount     0
promotion_1               0
promotion_2               0
promotion_3               0
promotion_4               0
promotion_5               0
promotion_6               0
revenue                   0
dtype: int64

- annual_income에 24개의 null 값 존재. 
- 분석과정 이전에 처리 필요!

#### 2.2 annual_income의 결측치 처리
- 240개의 데이터중에 24개만 결측치
- 결측치 데이터를 삭제하는 것으로 결정

In [36]:
df = df.dropna()
df.isnull().sum()

ID                       0
signup_ym                0
birth_year               0
annual_income            0
marital_status           0
children                 0
recency                  0
amount_alcohol           0
amount_fruit             0
amount_meat              0
amount_fish              0
amount_snack             0
amount_general           0
num_purchase_web         0
num_purchase_store       0
num_purchase_discount    0
promotion_1              0
promotion_2              0
promotion_3              0
promotion_4              0
promotion_5              0
promotion_6              0
revenue                  0
dtype: int64

- 결측치가 지워졌음을 확인할 수 있음

#### 2.3 object_cols의 unique값 확인하기

In [21]:
object_cols = df.columns[df.dtypes == 'object']
object_cols

Index(['signup_ym', 'marital_status'], dtype='object')

In [39]:
def unique_val(df):
    object_cols = df.columns[df.dtypes == 'object'] # object인 col 저장 
    
    for col in object_cols:
        print(f'{col}의 unique값 갯수: {df[col].nunique()}개')
        print(sorted(df[col].unique()),'\n')

In [40]:
unique_val(df)

signup_ym의 unique값 갯수: 24개
['2020-10', '2020-11', '2020-12', '2021-01', '2021-02', '2021-03', '2021-04', '2021-05', '2021-06', '2021-07', '2021-08', '2021-09', '2021-10', '2021-11', '2021-12', '2022-01', '2022-02', '2022-03', '2022-04', '2022-05', '2022-06', '2022-07', '2022-08', '2022-09']

marital_status의 unique값 갯수: 4개
['미혼', '배우자 있음', '사별', '이혼']

- 2020년: 10월 ~ 12월 
- 2021년: 1월 ~ 12월 
- 2022년: 1월 ~ 9월
의 데이터 값 존재

#### 2.4 age 칼럼 추가하기

In [43]:
# datetime라이브러리로 올해의 연도 추출하기 
import datetime
year = datetime.datetime.today().year

df['birth_year'] = year - df['birth_year']
df = df.rename(columns={'birth_year':'age'})

In [44]:
df.head()

,ID,signup_ym,age,annual_income,marital_status,children,recency,amount_alcohol,amount_fruit,amount_meat,amount_fish,amount_snack,amount_general,num_purchase_web,num_purchase_store,num_purchase_discount,promotion_1,promotion_2,promotion_3,promotion_4,promotion_5,promotion_6,revenue
0,5524,2020-12,59,75579400.0,미혼,0,58,825500,114400,709800,223600,114400,114400,8,4,3,0,0,0,0,0,1,11
1,2174,2022-06,62,60247200.0,미혼,2,38,14300,1300,7800,2600,1300,7800,1,2,2,0,0,0,0,0,0,11
2,4141,2021-11,51,93096900.0,배우자 있음,0,26,553800,63700,165100,144300,27300,54600,8,10,1,0,0,0,0,0,0,11
3,6182,2022-05,32,34639800.0,배우자 있음,1,26,14300,5200,26000,13000,3900,6500,2,4,2,0,0,0,0,0,0,11
4,5324,2022-04,35,75780900.0,배우자 있음,1,94,224900,55900,153400,59800,35100,19500,5,6,5,0,0,0,0,0,0,11

- birth_year 대신에 age 칼럼을 추가함?

#### 2.5 구매 금액 합계 및 구매 횟수 칼럼

In [46]:
df['amount_total'] = (df['amount_alcohol'] +
                      df['amount_fruit'] +
                      df['amount_meat']+
                      df['amount_fish']+
                      df['amount_snack'] +
                      df['amount_general'])
df.head()

,ID,signup_ym,age,annual_income,marital_status,children,recency,amount_alcohol,amount_fruit,amount_meat,amount_fish,amount_snack,amount_general,num_purchase_web,num_purchase_store,num_purchase_discount,promotion_1,promotion_2,promotion_3,promotion_4,promotion_5,promotion_6,revenue,amount_total
0,5524,2020-12,59,75579400.0,미혼,0,58,825500,114400,709800,223600,114400,114400,8,4,3,0,0,0,0,0,1,11,2102100
1,2174,2022-06,62,60247200.0,미혼,2,38,14300,1300,7800,2600,1300,7800,1,2,2,0,0,0,0,0,0,11,35100
2,4141,2021-11,51,93096900.0,배우자 있음,0,26,553800,63700,165100,144300,27300,54600,8,10,1,0,0,0,0,0,0,11,1008800
3,6182,2022-05,32,34639800.0,배우자 있음,1,26,14300,5200,26000,13000,3900,6500,2,4,2,0,0,0,0,0,0,11,68900
4,5324,2022-04,35,75780900.0,배우자 있음,1,94,224900,55900,153400,59800,35100,19500,5,6,5,0,0,0,0,0,0,11,548600